# View Position Position Property

Source: https://www.revitapidocs.com/2026/ab4953f3-1df2-d057-9b5c-63d452cce7d8.htm

---

| View Position Position Property |
| --- |

Specifies view's position.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public XYZ Position { get; set; }
```

```
Public Property Position As XYZ
	Get
	Set
```

```
public:
property XYZ^ Position {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

```
member Position : XYZ with get, set
```

#### Property Value

XYZ Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

ViewPosition Class Autodesk.Revit.DB Namespace